package util_p;

import java.util.regex.Pattern;

public class RegexMain {

	public static void main(String[] args) {
		System.out.println(Pattern.matches("Àå", "Àåµ¿°Ç"));    //.*"Àå" À¸·Î ½ÃÀÛÇÏ´Â ¸ğµç¹®ÀÚ¿­(±âÈ£Æ÷ÇÔ)
		System.out.println(Pattern.matches("Àå.*", "Àåµ¿°Ç"));  //."Àå" À¸·Î ½ÃÀÛÇÏ´Â µÎÀÚ¸®¸¸
		System.out.println(Pattern.matches("Àå.*", "ÀåÇõ"));   //.*Àå.* ÀåÀ» Æ÷ÇÔÇÑ ¸ğµç¹®ÀÚ¿­
		System.out.println(Pattern.matches("Àå.*", "ÃÖÀå±º"));  // Àå* ÀåÀ¸·Î¸¸ µÇ¾îÀÖ´Â ¹®ÀÚ   ex)Àå*:Àå,ÀåÀåÀåÀåÀåÀåÀå,ÀåÀå,ÀåÀåÀå,
	    	
		
		String [] mmArr= {"Àåµ¿°Ç","°Ç","Àå¼­°Ç","ÀåÇõ","Àå³²°Ç","Àå3","Àåºó°Ç",
                "Àå","Àå±º","ÃÖÀå±º","¹ÚÀå±º","Àå±º´Ô","ÀåÀåÀåÀåÀåÀåÀå","ÀåÀå","°íÃßÀå",
                "¹Ì¶õ´ÙÄ¿","Å°Ä¿","½ÖÇÇ","°èÇÇ","¿øµÎÄ¿ÇÇÀå±º",
                "ÀåÀåÀå","±è¾ØÀåÀÌ´Ù","Çöºó","¿øºó","¹Ì½ºÅÍºó","Ä¿ÇÇºó","Ä¿ÇÇ","¿øµÎÄ¿ÇÇ","ÀåÈñºó",
                "¤¡¤¤¤§","¤¡¤©¤¤","¤À¤Ã¤Ó¤Ä¤À","¤À¤Ä¤Ã¤À¤Á¤Ã","¤¡¤Ã¤Ä¤Ä¤Ä¤©¤¤",
                "ÇÏÇÏÇÏ","ÇÏÈ£Çã","»K¸…ÇÏ","ÇÏÇĞ","ÇÏÇá","°¡±ã°ø±¹","Â¯ÂÄ¸Ç","¾¦¤¤“U","¼§›÷œ¶",
                "´Ù","°ø¼®È£","±èÈñ¾Ö",
                "³ª¾ßºñ","³ªºñ¾ß","³ó¤²¿ÕÃ¢","Àå¤¤ºñ¿ë¼á",
                "³ÊÅ»ºñÅĞ¾ÆºØ´Ï","³Êºñ¾Æ´Ï","Çì¸£³Êºñ¾Æ¼§¬—",
                "123-456","1234-5678",
                "1234-5678-9012","123-5678-9012","12-5678-9012","12-568-9012",
                "123-678-9012","123-567833-9012","12-58-9012","1a",
                "abc","abc_def","1234","9846","ab_1234","ab1234",
                "aaa@aaa.aaa","aaaaaa.aaa@","aaa12aaa_aaa@",
                "ab56","AABB","aBCd","1","3","1234abc@aaa.aaa",
                "1234abc@aaa.a","1a2b","a12",
                "^","^^","12^34abc@aaa.aaa","1a2b^","^a12","123456.^",
                "\\^","^\\^",".^","\\^^",
                "1234abc@aaa.aa.va","1234abc@a.aa.a.a.va"};
		
	String [] ppArr = {"Àå","Àå.","Àå.*",".*Àå.*",".Àå.","Àå*",".*ºó"   //.*ºó :"ºó"À¸·Î ³¡³ª´Â ¹®ÀÚµé ex)ºó.*:Çöºó,¿øºó,¹Ì½ºÅÍºó,Ä¿ÇÇºó,ÀåÈñºó,
	                   ,".*ºó°Ç",".*(ºó°Ç)",".*(ºó|°Ç)",".*ºó|°Ç",".*[ºó°Ç]",".*[ºó|°Ç]"     //.*(ºó|°Ç) "ºó","°Ç" 
	                   ,".*(Àå±º|Ä¿ÇÇ)",".*[Àå±º|Ä¿ÇÇ]"         //".*(Àå±º|Ä¿ÇÇ)" ´Â Àå±ºÀ¸·Î ³¡³ª°Å³ª Ä¿ÇÇ·Î ³¡³ª´Â ¹®ÀÚµé
                       ,"\\d","\\d*","\\D*","\\W*"               //".*[Àå±º|Ä¿ÇÇ]" ´Â Àå,±º,Àå±º,Ä¿,ÇÇ,Ä¿ÇÇ ·Î ³¡³ª´Â ¹®ÀÚµéÀÌ ´Ù³ª¿È
	                   ,"[0-9]","[0-9]*","[a-z]*","[A-Z]*","[A-Za-z0-9]*"  //"\\d" ¼ıÀÚ ÇÑÀÚ¸®¼ö ¸¸ ³ª¿È,"\\d*" ¼ıÀÚ ,"\\D" ¼ıÀÚ»©°í ´Ù³ª¿È
	                   ,"[A-Za-z0-9]*@[A-Za-z0-9.]*"     //"[A-Za-z0-9]*@[A-Za-z0-9.]*" @µµ Æ÷ÇÔ ¸ğµç°Ô³ª¿È
	                   ,".{4}",".{3,}",".{3,5}"      //".{4}",".{3,}",".{3,5}": .{4}´Â 4±ÛÀÚ¸¸, .{3,}Àº 3±ÛÀÚºÎÅÍ ¸ğµÎ .{3,5}´Â 3±ÛÀÚºÎÅÍ5±ÛÀÚ
	                   ,"[0-9]{2,3}-[0-9]{3,4}-[0-9]{4}"    //<-- ÀüÈ­¹øÈ£ ¸¸µé¶§ »ç¿ë
	                   ,"[^0-9]*","[0-9^]*","\\^*","[^^]*" //"[^0-9]*" : 0~9¼ıÀÚ¸¦ Á¦¿ÜÇÏ°í ¸ğµç°Í,"\\^*" ^ À¸·Î¸¸ µÇ¾îÀÖ´Â°Íµé, "[0-9^]* 0~9¼ıÀÚ¿Í^ ³ª¿È
	                   ,"[¤¡-¤¾]*","[¤¿-¤Ó]*","[°¡-ÆR]*","[¤¡-¤¾¤¿-¤Ó°¡-ÆR]*"    //"[°¡-ÆR]*" : ÇÑ±Û µé¸¸ ³ª¿È
	                   ,"[°¡-ƒ‰¤¡]*",".*[³ª-ˆ¢¤¤][¹Ù-•½¤²][¾Æ-Ÿç¤·].*"//"[°¡-ƒ‰¤¡]*" : ¤¡ Æ÷ÇÔ¸¸ Ã£°í½ÍÀ»¶§ , ".*[³ª-ˆ¢¤¤][¹Ù-•½¤²][¾Æ-Ÿç¤·].*" ¤¤¤²¤¾ µé¾îÀÖ´Â°Å Ã£À»¶§
	};                                                     //"\\W*" ¿µ¹® ¼ıÀÚ »©°í ÀüºÎ³ª¿È
	for(String pp : ppArr) {                              //"[0-9]" 0ºÎÅÍ 9 ¿¡¼­ÀÇ ¼ıÀÚ¸¸ ³ª¿È
		System.out.print(pp+":");                         //"[0-9]*","[a-z]*" 0~9,a~z Àº 0~9,a~z Ã¹¹øÂ° ÀÚ¸®¸¸ °°Àº ¸ğµç°Ô³ª¿È.
	}                                                  //"[A-Za-z0-9]*" A~Z,a~z,0~9 Æ÷ÇÔµÇ¾îÀÖ´Â°ÍµéÀÌ ¸ğµÎ ³ª¿È
		for(String mm : mmArr) {                          //^:Á¦¿Ü ex)[^0-9]* Àº 0-9 ¼ıÀÚ ¸¦ Á¦¿ÜÇÏ°í ´Ù³ª¿È
			String pp;
			if(Pattern.matches(pp, mm)) {
			System.out.print(mm+",");
			}
		}
		
		System.out.println();
	}
		
		
		

	}

}
